testing/Serverless-Artillery/users_api_script.yml
# Thank you for trying serverless-artillery!
# This default script is intended to get you started quickly.
# There is a lot more that Artillery can do.
# You can find great documentation of the possibilities at:
# https://artillery.io/docs/  ########
config:
  # this hostname will be used as a prefix for each URI in the flow unless a complete URI is specified
  target: "https://nsc-fun-dev-usw2-tsmtestfunction.azurewebsites.net/api/HttpTriggerLoadTest"
  phases:
    -
      duration: 3600
      arrivalRate: 10
scenarios:
  - name: "Load Test"
    flow:
      - get:
          url: "/users"